tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationPlatform.cpp
#include "IrrigationPlatform.h"

#include <Esp32Base.h>
#include <esp_system.h>
#include <esp_mac.h>
#include <time.h>
#include <sys/time.h>

#include <cstdio>
#include <cstring>

#include <PlatformPublishPolicy.h>
#include <ports/Esp32MqttPort.h>
#include <ports/Esp32RecordStorage.h>
#include <ports/Esp32Diagnostics.h>

#include "BoardPins.h"
#include "IrrigationApp.h"
#include "IrrigationConfig.h"
#include "IrrigationEvents.h"
#include "IrrigationIotSecrets.h"
#include "IrrigationAuditStore.h"
#include "IrrigationPlatformRecords.h"
#include "WateringRecordStore.h"
#include "IrrigationParameterConfig.h"
#include "IrrigationTypes.h"
#include "WateringScheduler.h"
#include "IrrigationSdkModel.generated.h"

namespace IrrigationPlatform {
namespace {

using namespace iot_device;

constexpr size_t kTopicBytes = 129;
constexpr size_t kWillBytes = 512;
constexpr size_t kOutputBytes = 4097;
constexpr size_t kCommandSlots = 6;
constexpr size_t kCommandFrameBytes = 1024;
constexpr size_t kWateringScratchBytes =
    RecordStream::HeaderBytes +
    WateringRecordCodec::kPayloadSize;  // IR/v1 header + watering payload
constexpr size_t kAuditScratchBytes =
    RecordStream::HeaderBytes + 20;  // IR/v1 header + audit payload


char g_deviceId[40] = {};
char g_bootId[64] = {};
Esp32Diagnostics g_diagnostics;

char g_topic[kTopicBytes];
char g_will[kWillBytes];
char g_output[kOutputBytes];

bool g_configured = false;
bool g_stopping = false;
const char* g_configureResult = "not_run";

bool randomBytes(uint8_t output[16], void*) {
    esp_fill_random(output, 16);
    return true;
}

bool utcNow(char value[25], void*) {
    if (!Esp32BaseTime::isRealTime() ||
        Esp32BaseTime::snapshot().source != Esp32BaseTime::SOURCE_NTP) {
        return false;
    }
    timeval now{};
    gettimeofday(&now, nullptr);
    tm utc{};
    if (!gmtime_r(&now.tv_sec, &utc) ||
        strftime(value, 25, "%Y-%m-%dT%H:%M:%S", &utc) != 19) {
        return false;
    }
    return snprintf(value + 19, 6, ".%03uZ",
                    static_cast<unsigned>(now.tv_usec / 1000)) == 5;
}

SessionIo g_io = {randomBytes, utcNow, Esp32MqttPort::publish,
                  Esp32MqttPort::reconnect, nullptr};

ConnectionSession g_session(
    PlatformIdentity{"test", "irrigation-controller",
                     "irrigation-controller",
                     static_cast<uint32_t>(1),
                     "irrigation-controller-6-zone", g_deviceId},
    SessionBuffers{g_topic, g_topic, g_topic, sizeof(g_topic), g_will,
                   sizeof(g_will), g_output, sizeof(g_output)},
    g_io);

Esp32MqttPort g_port(g_session);

DynamicJsonDocument g_stateDoc(6144);
StaticJsonDocument<512> g_recordDoc;
StaticJsonDocument<1024> g_inputDoc;
StaticJsonDocument<1024> g_compareDoc;

ModelPublisher g_publisher(
    model_irrigation_controller_6_zone::contract, g_session, g_io, g_recordDoc,
    g_topic, sizeof(g_topic), g_output, sizeof(g_output),
    IrrigationPlatformRecords::codecs(),
    IrrigationPlatformRecords::codecCount());

// 统一发布策略：连接后逐帧门控发布，失败自动重试，避免一轮内联发挤爆 outbox。
// 定义在此供下方匿名命名空间内的发布函数与公共 begin()/poll() 共用。
PlatformPublishPolicy g_publishPolicy(
    model_irrigation_controller_6_zone::contract);
bool g_policyConnected = false;


// ---- commands -------------------------------------------------------------

CommandSlot g_commandSlots[kCommandSlots];
uint8_t g_commandFrames[kCommandSlots * kCommandFrameBytes];

struct PendingCommand {
    CommandHandle handle{};
    char capability[40] = {};
    char commandId[37] = {};
    bool active = false;
    bool runningSent = false;
    WateringSource source = WateringSource::LocalWeb;
};
PendingCommand g_pending[kCommandSlots];

const char* kKeyPlan = "parameter.plan";
const char* kKeyZone = "parameter.zone";
const char* kKeyZoneBaseline = "parameter.zone-baseline";
const char* kKeySystemField = "parameter.system-field";
const char* kKeyAutomatic = "parameter.automatic-watering";
const char* kKeyStartManual = "operation.start-manual";
const char* kKeyStop = "operation.stop";
const char* kKeySingleOutput = "operation.single-output";

bool keyIs(const char* key, const char* expected) {
    return key && std::strcmp(key, expected) == 0;
}

const char* configSaveReason(IrrigationApp::ConfigSaveError error) {
    switch (error) {
        case IrrigationApp::ConfigSaveError::Ok:
            return nullptr;
        case IrrigationApp::ConfigSaveError::RevisionMismatch:
            return "revision_conflict";
        case IrrigationApp::ConfigSaveError::ZoneUnavailable:
            return "zone_unavailable";
        case IrrigationApp::ConfigSaveError::Busy:
            return "busy";
        case IrrigationApp::ConfigSaveError::AuditUnavailable:
            return "persistence_error";
        case IrrigationApp::ConfigSaveError::Persistence:
            return "persistence_error";
        case IrrigationApp::ConfigSaveError::NotReady:
            return "controller_unavailable";
        case IrrigationApp::ConfigSaveError::InvalidValue:
        default:
            return "invalid_request";
    }
}

// Read one plan object into a firmware WateringPlan. Only enabled zones carry
// durations in the projection; disabled-zone durations no longer exist.
bool parsePlanObject(JsonObjectConst object, const IrrigationConfig& current,
                     WateringPlan& plan) {
    plan = {};
    const int id = object["id"].as<int>();
    if (id < 1 || id > static_cast<int>(kWateringPlanCount)) return false;
    plan.id = static_cast<uint8_t>(id);
    plan.configured = true;
    plan.startMinutes.fill(kUnusedStartMinute);

    const char* name = object["name"].as<const char*>();
    if (!name) return false;
    std::snprintf(plan.name.data(), plan.name.size(), "%s", name);
    plan.scheduleEnabled = object["automaticEnabled"].as<bool>();

    JsonArrayConst starts = object["startMinutes"].as<JsonArrayConst>();
    if (starts.isNull() || starts.size() > kPlanStartTimeCount) return false;
    uint8_t m = 0;
    for (JsonVariantConst minute : starts) {
        if (!minute.is<int>()) return false;
        const int value = minute.as<int>();
        if (value < 0 || value >= 24 * 60) return false;
        plan.startMinutes[m++] = static_cast<uint16_t>(value);
    }

    JsonArrayConst zones = object["zones"].as<JsonArrayConst>();
    if (zones.isNull() || zones.size() > BoardPins::kZoneCount) return false;
    for (JsonVariantConst z : zones) {
        const int zoneId = z["zoneId"].as<int>();
        const int minutes = z["durationMinutes"].as<int>();
        if (!BoardPins::isValidZoneId(static_cast<uint8_t>(zoneId)) ||
            !current.zones[BoardPins::zoneIndex(static_cast<uint8_t>(zoneId))].enabled) {
            return false;
        }
        plan.zoneDurationMinutes[BoardPins::zoneIndex(static_cast<uint8_t>(zoneId))] =
            static_cast<uint16_t>(minutes);
    }
    return true;
}

// Build a watering request from a start-manual / single-output command.
WateringStartResult submitWatering(const CommandView& cmd, PendingCommand& pc) {
    IrrigationApp& app = IrrigationApp::instance();
    WateringRequest request{};
    request.source = WateringSource::WechatMiniprogram;
    // commandId is a fixed 36-byte (UUID text) field with no trailing NUL.
    std::memset(request.commandId.data(), 0, request.commandId.size());
    std::strncpy(request.commandId.data(), cmd.commandId,
                 request.commandId.size());

    JsonArrayConst zones = cmd.parameters["zones"].as<JsonArrayConst>();
    if (keyIs(cmd.capability->key, kKeySingleOutput)) {
        const uint8_t zoneId =
            static_cast<uint8_t>(cmd.parameters["zoneId"].as<int>());
        const char* mode = cmd.parameters["mode"].as<const char*>();
        request.stepCount = 1;
        request.targetMode = WateringTargetMode::Volume;
        request.steps[0].zoneId = zoneId;
        if (mode && std::strcmp(mode, "duration") == 0) {
            request.targetMode = WateringTargetMode::Duration;
            request.steps[0].targetDurationSec =
                cmd.parameters["durationSeconds"].as<uint32_t>();
        } else {
            request.steps[0].targetWaterMl =
                cmd.parameters["targetWaterMl"].as<uint32_t>();
        }
    } else {
        request.targetMode = WateringTargetMode::Duration;
        uint8_t count = 0;
        for (JsonVariantConst z : zones) {
            if (count >= BoardPins::kZoneCount) return WateringStartResult::InvalidRequest;
            request.steps[count].zoneId =
                static_cast<uint8_t>(z["zoneId"].as<int>());
            request.steps[count].targetDurationSec =
                z["durationMinutes"].as<uint32_t>() * 60U;
            ++count;
        }
        request.stepCount = count;
    }
    return app.startWatering(request);
}

const char* startResultReason(WateringStartResult result) {
    switch (result) {
        case WateringStartResult::Started:
            return nullptr;
        case WateringStartResult::Busy:
            return "busy";
        case WateringStartResult::NotReady:
            return "controller_unavailable";
        case WateringStartResult::PreviousResultPending:
            return "busy";
        case WateringStartResult::HardwareFailure:
            return "hardware_failure";
        default:
            return "invalid_request";
    }
}

