tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationPlatform.cpp
CommandDecision decideCommand(const CommandView& cmd, void*) {
    IrrigationApp& app = IrrigationApp::instance();
    const char* key = cmd.capability->key;

    if (keyIs(key, kKeyStop)) {
        return {true, nullptr};  // idle stop is idempotent success
    }
    if (keyIs(key, kKeyPlan) || keyIs(key, kKeyZone) ||
        keyIs(key, kKeyZoneBaseline) || keyIs(key, kKeySystemField) ||
        keyIs(key, kKeyAutomatic)) {
        if (!app.businessReady()) return {false, "controller_unavailable"};
        return {true, nullptr};
    }
    if (keyIs(key, kKeyStartManual) || keyIs(key, kKeySingleOutput)) {
        if (!app.businessReady()) return {false, "controller_unavailable"};
        if (app.wateringActive()) return {false, "busy"};
        // Re-validate by actually attempting admission in execute; decide only
        // guards the obvious exclusions so the same business validator runs.
        return {true, nullptr};
    }
    return {false, "unknown_capability"};
}

void executeCommand(CommandHandle handle, const CommandView& cmd, void*);

CommandInbox g_inbox(
    model_irrigation_controller_6_zone::contract, g_session, g_publisher, g_io,
    g_inputDoc, g_compareDoc, g_commandSlots, kCommandSlots, g_commandFrames,
    kCommandFrameBytes, decideCommand, executeCommand, nullptr);

void executeCommand(CommandHandle handle, const CommandView& cmd, void*) {
    IrrigationApp& app = IrrigationApp::instance();
    PendingCommand& pc = g_pending[handle.index];
    pc = {};
    pc.handle = handle;
    std::snprintf(pc.capability, sizeof(pc.capability), "%s",
                  cmd.capability->key);
    std::snprintf(pc.commandId, sizeof(pc.commandId), "%s", cmd.commandId);
    pc.active = true;
    const char* key = cmd.capability->key;

    if (keyIs(key, kKeyPlan)) {
        const IrrigationConfig* current = app.configuration();
        if (!current) {
            g_inbox.progress(handle, ProgressStatus::Failed,
                             "persistence_error");
            pc.active = false;
            return;
        }
        const uint32_t expectedRevision =
            cmd.parameters["revision"].as<uint32_t>();
        const char* action = cmd.parameters["action"].as<const char*>();
        IrrigationApp::ConfigSaveError result = IrrigationApp::ConfigSaveError::InvalidValue;

        if (action && std::strcmp(action, "delete") == 0) {
            const int id = cmd.parameters["id"].as<int>();
            if (id < 1 || id > static_cast<int>(kWateringPlanCount)) {
                g_inbox.progress(handle, ProgressStatus::Failed,
                                 "invalid_request");
                pc.active = false;
                return;
            }
            WateringPlan plan{};
            plan.id = static_cast<uint8_t>(id);
            result = app.savePlanSlot(plan, true, expectedRevision);
        } else if (action && std::strcmp(action, "set-enabled") == 0) {
            const int id = cmd.parameters["id"].as<int>();
            if (id < 1 || id > static_cast<int>(kWateringPlanCount)) {
                g_inbox.progress(handle, ProgressStatus::Failed,
                                 "invalid_request");
                pc.active = false;
                return;
            }
            WateringPlan plan = current->plans[id - 1];
            plan.id = static_cast<uint8_t>(id);
            plan.scheduleEnabled = cmd.parameters["automaticEnabled"].as<bool>();
            result = app.savePlanSlot(plan, false, expectedRevision);
        } else if (action && std::strcmp(action, "upsert") == 0) {
            WateringPlan plan{};
            if (parsePlanObject(cmd.parameters["plan"].as<JsonObjectConst>(),
                                *current, plan)) {
                result = app.savePlanSlot(plan, false, expectedRevision);
            }
        }

        if (result == IrrigationApp::ConfigSaveError::Ok) {
            g_inbox.progress(handle, ProgressStatus::Succeeded);
        } else {
            g_inbox.progress(handle, ProgressStatus::Failed,
                             configSaveReason(result));
        }
        pc.active = false;
        return;
    }

    if (keyIs(key, kKeyZone)) {
        const uint32_t revision = cmd.parameters["revision"].as<uint32_t>();
        const int zoneId = cmd.parameters["zoneId"].as<int>();
        const IrrigationConfig* current = app.configuration();
        if (!current || zoneId < 1 || zoneId > BoardPins::kZoneCount) {
            g_inbox.progress(handle, ProgressStatus::Failed, "invalid_request");
            pc.active = false;
            return;
        }
        const std::size_t zi = BoardPins::zoneIndex(static_cast<uint8_t>(zoneId));
        char name[kObjectNameCapacity]{};
        bool enabled = current->zones[zi].enabled;
        if (cmd.parameters["name"].is<const char*>()) {
            std::snprintf(name, sizeof(name), "%s",
                          cmd.parameters["name"].as<const char*>());
        } else {
            std::snprintf(name, sizeof(name), "%s",
                          current->zones[zi].name.data());
        }
        if (cmd.parameters["enabled"].is<bool>()) {
            enabled = cmd.parameters["enabled"].as<bool>();
        }
        const IrrigationApp::ConfigSaveError result = app.saveZoneInfo(
            static_cast<uint8_t>(zoneId), name, enabled, revision);
        g_inbox.progress(handle,
                         result == IrrigationApp::ConfigSaveError::Ok
                             ? ProgressStatus::Succeeded
                             : ProgressStatus::Failed,
                         configSaveReason(result));
        pc.active = false;
        return;
    }

    if (keyIs(key, kKeyZoneBaseline)) {
        const uint32_t revision = cmd.parameters["revision"].as<uint32_t>();
        const int zoneId = cmd.parameters["zoneId"].as<int>();
        uint32_t pulseRate = 0;
        if (cmd.parameters["baselinePulseRateX10000"].is<int>()) {
            const int value = cmd.parameters["baselinePulseRateX10000"].as<int>();
            if (value < 0) {
                g_inbox.progress(handle, ProgressStatus::Failed, "invalid_request");
                pc.active = false;
                return;
            }
            pulseRate = static_cast<uint32_t>(value);
        }
        const IrrigationApp::ConfigSaveError result = app.setZoneBaseline(
            static_cast<uint8_t>(zoneId), pulseRate, revision);
        g_inbox.progress(handle,
                         result == IrrigationApp::ConfigSaveError::Ok
                             ? ProgressStatus::Succeeded
                             : ProgressStatus::Failed,
                         configSaveReason(result));
        pc.active = false;
        return;
    }

    if (keyIs(key, kKeySystemField)) {
        const char* field = cmd.parameters["field"].as<const char*>();
        const JsonVariantConst value = cmd.parameters["value"];
        bool ok = false;
        if (value.is<int>() || value.is<uint32_t>() || value.is<long>()) {
            ok = app.applyRemoteSystemField(field, true, value.as<int32_t>(),
                                            false, false, nullptr);
        } else if (value.is<bool>()) {
            ok = app.applyRemoteSystemField(field, false, 0,
                                            true, value.as<bool>(), nullptr);
        } else if (value.is<const char*>()) {
            ok = app.applyRemoteSystemField(field, false, 0,
                                            false, false,
                                            value.as<const char*>());
        }
        g_inbox.progress(handle,
                         ok ? ProgressStatus::Succeeded : ProgressStatus::Failed,
                         ok ? nullptr : "invalid_field_value");
        pc.active = false;
        return;
    }

    if (keyIs(key, kKeyAutomatic)) {
        const char* mode = cmd.parameters["mode"].as<const char*>();
        bool ok = false;
        if (mode && std::strcmp(mode, "enabled") == 0) {
            ok = app.resumeAutomaticWatering();
        } else if (mode && std::strcmp(mode, "paused-indefinitely") == 0) {
            ok = app.pauseAutomaticWateringIndefinitely();
        } else if (mode && std::strcmp(mode, "paused-until") == 0) {
            const uint32_t resume =
                cmd.parameters["resumeAtEpoch"].as<uint32_t>();
                ok = app.pauseAutomaticWateringUntil(resume);
        }
        g_inbox.progress(handle, ok ? ProgressStatus::Succeeded
                                    : ProgressStatus::Failed,
                         ok ? nullptr : "persistence_error");
        pc.active = false;
        return;
    }

    if (keyIs(key, kKeyStop)) {
        // Stop is an independent instant command: it succeeds even when idle.
        app.stopWatering();
        g_inbox.progress(handle, ProgressStatus::Succeeded);
        pc.active = false;
        return;
    }

    // start-manual / single-output are process commands.
    const WateringStartResult result = submitWatering(cmd, pc);
    if (result != WateringStartResult::Started) {
        g_inbox.progress(handle, ProgressStatus::Failed,
                         startResultReason(result));
        pc.active = false;
        return;
    }
    // running progress is emitted by progressPoll once the controller is active.
}

void progressPoll() {
    IrrigationApp& app = IrrigationApp::instance();
    for (PendingCommand& pc : g_pending) {
        if (!pc.active) continue;
        const bool isProcess =
            keyIs(pc.capability, kKeyStartManual) ||
            keyIs(pc.capability, kKeySingleOutput);
        if (!isProcess) { pc.active = false; continue; }
        if (!pc.runningSent && app.wateringActive()) {
            if (g_inbox.progress(pc.handle, ProgressStatus::Running))
                pc.runningSent = true;
            continue;
        }
        if (app.wateringActive()) continue;
        // Read the terminal result only once the process has gone idle so the
        // status reflects this command's outcome rather than a stale value.
        const WateringStatus status = app.wateringStatus();
        ProgressStatus terminal = ProgressStatus::Succeeded;
        const char* reason = nullptr;
        if (status.lastResult == WateringResult::Stopped) {
            terminal = ProgressStatus::Canceled;
        } else if (status.lastResult == WateringResult::Failed ||
                   status.lastResult == WateringResult::Incomplete) {
            terminal = ProgressStatus::Failed;
            reason = "watering_failed";
        }
        if (g_inbox.progress(pc.handle, terminal, reason)) pc.active = false;
    }
}

// ---- identity -------------------------------------------------------------

