tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationPlatform.cpp
bool buildDeviceId() {
    // Runs before Esp32Base::begin() (MQTT must be claimed pre-begin), so the
    // WiFi driver is not initialised yet and esp_read_mac(ESP_MAC_WIFI_STA)
    // fails. Read the eFuse base MAC directly; on single-MAC ESP32 it is the
    // STA MAC and the stable device identity.
    uint8_t mac[6] = {};
    if (esp_efuse_mac_get_default(mac) != ESP_OK) return false;
    // "esp32-irr-" (10 chars) + 12 hex chars = 22, NUL excluded.
    const int written = snprintf(
        g_deviceId, sizeof(g_deviceId), "esp32-irr-%02x%02x%02x%02x%02x%02x",
        mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return written == 22 && static_cast<size_t>(written) < sizeof(g_deviceId);
}

void buildBootId() {
    const auto now = Esp32BaseTime::snapshot();
    snprintf(g_bootId, sizeof(g_bootId), "%s-%lu-%08lx", g_deviceId,
             static_cast<unsigned long>(Esp32BaseSystem::bootCount()),
             static_cast<unsigned long>(now.bootId));
}

// ---- time helpers ---------------------------------------------------------

void writeIso(char out[25], uint32_t epochSec) {
    if (!epochSec) {
        out[0] = '\0';
        return;
    }
    time_t seconds = static_cast<time_t>(epochSec);
    tm utc{};
    gmtime_r(&seconds, &utc);
    strftime(out, 25, "%Y-%m-%dT%H:%M:%S.000Z", &utc);
}

// ---- state projection -----------------------------------------------------

const char* sourceKey(WateringSource source) {
    switch (source) {
        case WateringSource::LocalWeb:
            return "local_web";
        case WateringSource::WechatMiniprogram:
            return "wechat_miniprogram";
        case WateringSource::AutomaticPlan:
            return "device_schedule";
    }
    return "local_web";
}

const char* nextAutomaticStatus(NextAutomaticWateringStatus status) {
    switch (status) {
        case NextAutomaticWateringStatus::Available:
            return "available";
        case NextAutomaticWateringStatus::NoEnabledPlans:
            return "no-enabled-plans";
        case NextAutomaticWateringStatus::TimeUnavailable:
            return "time-unavailable";
        case NextAutomaticWateringStatus::RtcRollback:
            return "rtc-rollback";
        case NextAutomaticWateringStatus::PausedIndefinitely:
            return "paused-indefinitely";
    }
    return "time-unavailable";
}

const char* activityKind(const WateringStatus& s) {
    if (!s.active) return "idle";
    if (s.purpose == WateringPurpose::ZoneFlowLearning) return "learning";
    if (s.source == WateringSource::AutomaticPlan) return "automatic";
    if (s.targetMode == WateringTargetMode::Volume) return "single-output";
    return "manual";
}

const char* activityPhase(WateringState state) {
    switch (state) {
        case WateringState::StartingZone:
            return "starting";
        case WateringState::WaitingForFlow:
            return "waiting-flow";
        case WateringState::WateringZone:
            return "watering";
        case WateringState::StoppingZone:
            return "stopping";
        case WateringState::SwitchingZone:
            return "switching";
        default:
            return "idle";
    }
}

void projectOverview(const IrrigationApp& app, const WateringStatus& status) {
    g_stateDoc.clear();
    g_stateDoc["activity"] = status.active ? "active" : "idle";
    const bool critical =
        !app.businessReady() || app.unexpectedFlowAlarm() ||
        app.schedulerStorageFault();
    const bool warning =
        app.recordStorageFault() || app.eventStorageFault() ||
        app.checkpointStorageFault() || app.schedulerTimeState() ==
                                            WateringScheduler::TimeState::RtcRollback;
    g_stateDoc["health"] = critical ? "critical" : warning ? "warning" : "normal";
}

void projectZones(const IrrigationConfig& config) {
    g_stateDoc.clear();
    JsonArray zones = g_stateDoc.createNestedArray("zones");
    for (const ZoneConfig& zone : config.zones) {
        if (!zone.enabled) continue;
        JsonObject item = zones.createNestedObject();
        item["zoneId"] = zone.id;
        item["name"] = zone.name.data();
    }
}

void projectZoneMaintenance(const IrrigationConfig& config) {
    g_stateDoc.clear();
    g_stateDoc["revision"] = config.revision;
    JsonArray zones = g_stateDoc.createNestedArray("zones");
    for (const ZoneConfig& zone : config.zones) {
        if (!zone.enabled) continue;
        JsonObject item = zones.createNestedObject();
        item["zoneId"] = zone.id;
        if (zone.baselinePulseRateX10000) {
            item["baselinePulseRateX10000"] = zone.baselinePulseRateX10000;
        } else {
            item["baselinePulseRateX10000"] = nullptr;
        }
        item["baselineFlowMlPerMinute"] = nullptr;
    }
}

void projectCalibration(const IrrigationConfig& config) {
    g_stateDoc.clear();
    g_stateDoc["coefficientPulsesPerLiterX100"] =
        config.flowMeter.pulsesPerLiterX100;
}

void projectSystemParameters(const IrrigationConfig& config) {
    g_stateDoc.clear();
    JsonObject valve = g_stateDoc.createNestedObject("valve");
    valve["pullInTimeMs"] = config.valveDrive.pullInTimeMs;
    valve["switchDelayMs"] = config.valveDrive.switchDelayMs;
    valve["pwmFrequencyHz"] = config.valveDrive.pwmFrequencyHz;
    valve["holdDutyPercent"] = config.valveDrive.holdDutyPercent;
    JsonObject pump = g_stateDoc.createNestedObject("pump");
    pump["enabled"] = config.pump.enabled;
    pump["startDelayMs"] = config.pump.startDelayMs;
    pump["stopToValveCloseDelayMs"] = config.pump.stopToValveCloseDelayMs;
    JsonObject meter = g_stateDoc.createNestedObject("meter");
    meter["pulsesPerLiterX100"] = config.flowMeter.pulsesPerLiterX100;
    meter["flowStartTimeoutSeconds"] = config.flowProtection.flowStartTimeoutSec;
    meter["noFlowTimeoutSeconds"] = config.flowProtection.noFlowTimeoutSec;
    JsonObject flow = g_stateDoc.createNestedObject("flow");
    flow["unexpectedFlowDelaySeconds"] =
        config.flowProtection.unexpectedFlowDelaySec;
    flow["unexpectedFlowWindowSeconds"] =
        config.flowProtection.unexpectedFlowWindowSec;
    flow["unexpectedFlowPulseCount"] =
        config.flowProtection.unexpectedFlowPulseCount;
    flow["deviationConfirmSeconds"] =
        config.flowProtection.flowDeviationConfirmSec;
    flow["lowFlowPercent"] = config.flowProtection.lowFlowPercent;
    flow["highFlowPercent"] = config.flowProtection.highFlowPercent;
    flow["lowFlowAction"] =
        config.flowProtection.lowFlowAction == FlowAlertAction::StopWatering
            ? "stop"
            : "alert";
    flow["highFlowAction"] =
        config.flowProtection.highFlowAction == FlowAlertAction::StopWatering
            ? "stop"
            : "alert";
    JsonObject limits = g_stateDoc.createNestedObject("limits");
    limits["maximumZoneDurationMinutes"] =
        config.runLimits.maximumZoneDurationMinutes;
    limits["maximumSingleOutputLiters"] =
        config.runLimits.maximumSingleOutputLiters;
    JsonObject system = g_stateDoc.createNestedObject("system");
    system["rtcRollbackThresholdMinutes"] =
        config.timeSafety.rtcRollbackThresholdMinutes;
    system["aliveCheckpointHours"] = config.timeSafety.aliveCheckpointHours;
}

