tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationPlatform.cpp
void projectPlans(const IrrigationConfig& config) {
    g_stateDoc.clear();
    g_stateDoc["revision"] = config.revision;
    JsonArray plans = g_stateDoc.createNestedArray("plans");
    for (const WateringPlan& plan : config.plans) {
        if (!plan.configured) continue;
        JsonObject item = plans.createNestedObject();
        item["id"] = plan.id;
        item["name"] = plan.name.data();
        item["automaticEnabled"] = plan.scheduleEnabled;
        JsonArray starts = item.createNestedArray("startMinutes");
        for (uint16_t minute : plan.startMinutes) {
            if (minute != kUnusedStartMinute) starts.add(minute);
        }
        JsonArray zones = item.createNestedArray("zones");
        for (const ZoneConfig& zone : config.zones) {
            if (!zone.enabled) continue;
            const uint16_t minutes =
                plan.zoneDurationMinutes[BoardPins::zoneIndex(zone.id)];
            if (!minutes) continue;
            JsonObject z = zones.createNestedObject();
            z["zoneId"] = zone.id;
            z["durationMinutes"] = minutes;
        }
    }
}

void projectAutomatic(const IrrigationApp& app) {
    g_stateDoc.clear();
    const AutomaticWateringState state = app.automaticWateringState();
    switch (state.mode) {
        case AutomaticWateringMode::PausedIndefinitely:
            g_stateDoc["mode"] = "paused-indefinitely";
            g_stateDoc["resumeAtEpoch"] = nullptr;
            break;
        case AutomaticWateringMode::PausedUntil:
            g_stateDoc["mode"] = "paused-until";
            g_stateDoc["resumeAtEpoch"] = state.resumeAtEpoch;
            break;
        default:
            g_stateDoc["mode"] = "enabled";
            g_stateDoc["resumeAtEpoch"] = nullptr;
            break;
    }
}

void projectRuntime(const IrrigationApp& app, const WateringStatus& s) {
    const auto* config = app.configuration();
    g_stateDoc.clear();
    g_stateDoc["ready"] = app.businessReady();
    const char* reason = "none";
    if (!app.businessReady()) {
        reason = app.configurationLoadResult() ==
                         IrrigationConfigStore::LoadResult::StorageUnavailable
                     ? "configuration_unavailable"
                     : "startup_check_failed";
        if (app.schedulerStorageFault()) reason = "scheduler_storage_unavailable";
    }
    g_stateDoc["readyReason"] = reason;

    JsonObject time = g_stateDoc.createNestedObject("time");
    const auto now = Esp32BaseTime::snapshot();
    time["trusted"] = now.synced;
    time["source"] = now.source == Esp32BaseTime::SOURCE_NTP
                         ? "ntp"
                         : now.source == Esp32BaseTime::SOURCE_RTC ? "rtc"
                                                                   : "none";
    if (now.synced)
        time["epoch"] = static_cast<long long>(now.epochSec);
    else
        time["epoch"] = nullptr;
    time["rtcAvailable"] = app.schedulerTimeState() !=
                           WateringScheduler::TimeState::Unavailable;
    time["rtcRollback"] = app.schedulerTimeState() ==
                          WateringScheduler::TimeState::RtcRollback;

    JsonObject nextAuto = g_stateDoc.createNestedObject("nextAutomatic");
    if (config) {
        const NextAutomaticWatering next =
            app.nextAutomaticWatering();
        nextAuto["status"] = nextAutomaticStatus(next.status);
        if (next.planId)
            nextAuto["planId"] = next.planId;
        else
            nextAuto["planId"] = nullptr;
        if (next.scheduledEpoch)
            nextAuto["scheduledAtEpoch"] =
                static_cast<long long>(next.scheduledEpoch);
        else
            nextAuto["scheduledAtEpoch"] = nullptr;
    } else {
        nextAuto["status"] = "time-unavailable";
        nextAuto["planId"] = nullptr;
        nextAuto["scheduledAtEpoch"] = nullptr;
    }

    JsonObject activity = g_stateDoc.createNestedObject("activity");
    activity["kind"] = activityKind(s);
    activity["commandId"] = nullptr;
    if (s.active)
        activity["zoneId"] = s.activeZoneId;
    else
        activity["zoneId"] = nullptr;
    activity["phase"] = s.active ? activityPhase(s.state) : "idle";
    activity["activityId"] = nullptr;
    activity["requestedDurationMs"] = nullptr;
    activity["elapsedMs"] = s.elapsedMs;
    activity["remainingMs"] = s.active ? s.currentZoneRemainingMs * 1000U : 0;
    activity["deadlineAt"] = nullptr;
    activity["timeQuality"] = now.synced ? "synchronized" : "uncertain";
    activity["clockUncertaintyMs"] = nullptr;
    activity["targetWaterMl"] = nullptr;
    activity["pulseCount"] = s.pulseCount;
    activity["estimatedWaterMl"] = s.totalEstimatedWaterMl;
    if (s.active)
        activity["flowMlPerMinute"] = s.currentFlowMlPerMinute;
    else
        activity["flowMlPerMinute"] = nullptr;
    activity["lowFlowActive"] = false;
    activity["highFlowActive"] = false;
    JsonArray steps = activity.createNestedArray("steps");
    if (s.active) {
        for (uint8_t i = 0; i < s.stepCount; ++i) {
            const auto& z = s.zones[i];
            if (z.zoneId == 0) continue;
            JsonObject step = steps.createNestedObject();
            step["zoneId"] = z.zoneId;
            step["targetDurationMs"] =
                static_cast<long long>(z.plannedDurationSec) * 1000U;
            if (z.targetWaterMl)
                step["targetWaterMl"] = z.targetWaterMl;
            else
                step["targetWaterMl"] = nullptr;
            const char* st = "pending";
            if (i < s.currentStepIndex)
                st = "completed";
            else if (i == s.currentStepIndex)
                st = "current";
            step["status"] = st;
        }
    }

    JsonArray faults = g_stateDoc.createNestedArray("faults");
    if (app.schedulerTimeState() == WateringScheduler::TimeState::RtcRollback)
        faults.add("rtc_rollback");
    if (app.unexpectedFlowAlarm()) faults.add("unexpected_flow");
    if (app.schedulerStorageFault()) faults.add("scheduler_storage");
    if (app.recordStorageFault()) faults.add("record_storage");
    if (app.eventStorageFault()) faults.add("event_storage");
}

// Build the diagnostics value into g_stateDoc. Returns false if the read
// cannot produce a frame; the token is returned for commit-after-queue.
bool buildDiagnostics(DiagnosticsFrameToken& token) {
    if (!g_diagnostics.read(g_stateDoc, g_bootId, token)) return false;

    g_stateDoc["bootNo"] = Esp32BaseSystem::bootCount();
    const auto mqtt = Esp32BaseMqtt::diagnostics();
    g_stateDoc["mqttAtt"] = mqtt.connectAttempts;
    const auto status = Esp32BaseMqtt::status();
    g_stateDoc["mqttErr"] = status.lastError == Esp32BaseMqtt::ERROR_NONE
                               ? nullptr
                               : Esp32BaseMqtt::errorName(status.lastError);
    g_stateDoc["wdt"] = Esp32BaseWatchdog::lifetimeResetCount();
    return true;
}

