tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationPlatform.cpp
bool buildSnapshot(const char* key) {
    IrrigationApp& app = IrrigationApp::instance();
    const IrrigationConfig* config = app.configuration();
    const WateringStatus status = app.wateringStatus();

    if (!std::strcmp(key, "state.overview")) {
        projectOverview(app, status);
        return true;
    }
    if (!std::strcmp(key, "state.runtime")) {
        projectRuntime(app, status);
        return true;
    }
    if (!std::strcmp(key, "state.diagnostics")) return true;  // token handled by caller
    if (!config) return false;  // config-backed frames need evidence
    if (!std::strcmp(key, "state.zones")) {
        projectZones(*config);
        return true;
    }
    if (!std::strcmp(key, "state.zone-maintenance")) {
        projectZoneMaintenance(*config);
        return true;
    }
    if (!std::strcmp(key, "state.calibration")) {
        projectCalibration(*config);
        return true;
    }
    if (!std::strcmp(key, "state.system-parameters")) {
        projectSystemParameters(*config);
        return true;
    }
    if (!std::strcmp(key, "parameter.plan")) {
        projectPlans(*config);
        return true;
    }
    if (!std::strcmp(key, "parameter.automatic-watering")) {
        projectAutomatic(app);
        return true;
    }
    return false;
}

// Publish one due snapshot frame. Uses the policy's per-connection sequence
// and is retried automatically on failure.
// Publish one due snapshot frame, scanning fairly from a rotating cursor so
// snapshots re-marked dirty every loop (overview/runtime/...) cannot starve
// frames later in the capability table.
static size_t g_scanCursor = 0;

bool publishDueSnapshot(uint32_t nowMs) {
    const auto& contract = model_irrigation_controller_6_zone::contract;
    for (size_t step = 0; step < contract.capabilityCount; ++step) {
        const size_t index = (g_scanCursor + step) % contract.capabilityCount;
        if (!g_publishPolicy.stateDue(index, nowMs)) continue;
        const char* key = contract.capabilities[index].key;
        g_scanCursor = (index + 1) % contract.capabilityCount;

        // Write-only maintenance commands: they are command channels, never
        // published as observations. The policy marks every snapshot dirty on
        // connect, so skip them explicitly; leaving them due would look like a
        // build failure and trigger the 5s queue-retry block that stalls all
        // later first frames.
        if (!std::strcmp(key, "parameter.zone") ||
            !std::strcmp(key, "parameter.zone-baseline") ||
            !std::strcmp(key, "parameter.system-field")) {
            g_publishPolicy.stateSkipped(index);  // clears dirty, no frame, no seq
            continue;
        }

        DiagnosticsFrameToken diagToken;
        const bool isDiagnostics = !std::strcmp(key, "state.diagnostics");
        if (isDiagnostics) {
            if (!buildDiagnostics(diagToken)) {
                g_publishPolicy.stateQueueFailed(nowMs);
                return false;
            }
        } else if (!buildSnapshot(key)) {
            g_publishPolicy.stateQueueFailed(nowMs);
            return false;
        }

        if (!g_publisher.state(key, g_publishPolicy.stateSequence(), g_stateDoc)) {
            g_publishPolicy.stateQueueFailed(nowMs);
            return false;
        }
        if (!g_publishPolicy.stateQueued(index, nowMs)) return false;
        if (isDiagnostics) g_diagnostics.commit(diagToken);  // only after queued
        return true;
    }
    return false;
}

// Mark a snapshot dirty only when its projected value actually changed.
// Unconditional re-marking made the device republish overview/runtime/...
// every loop (~5s) with no change, which is the traffic-governance violation.
struct ValueSignatures {
    uint32_t overview = 0;
    uint32_t runtime = 0;
    uint32_t plan = 0;
    uint32_t automatic = 0;
    bool haveOverview = false, haveRuntime = false, havePlan = false, haveAutomatic = false;
};
ValueSignatures g_signatures;

uint32_t fnvSignature() {
    static char buffer[6144];
    const size_t length = serializeJson(g_stateDoc, buffer, sizeof(buffer) - 1);
    uint32_t hash = 2166136261u;
    for (size_t i = 0; i < length; ++i) {
        hash ^= static_cast<uint8_t>(buffer[i]);
        hash *= 16777619u;
    }
    return hash;
}

void markIfChanged(const char* key, uint32_t& last, bool& have) {
    uint32_t current = fnvSignature();
    if (!have || current != last) {
        last = current;
        have = true;
        g_publishPolicy.markStateDirty(key);
    }
}

// Runtime carries time.epoch (the wall clock), which changes every second by
// nature; that is clock flow, not a business change. Exclude it from the
// change signature so a parked device does not republish runtime every loop.
void markRuntimeIfChanged(uint32_t& last, bool& have) {
    JsonVariant timeValue = g_stateDoc["time"];
    long long epoch = 0;
    bool hadEpoch = false;
    if (!timeValue.isNull() && timeValue.containsKey("epoch")) {
        if (!timeValue["epoch"].isNull()) { epoch = timeValue["epoch"].as<long long>(); hadEpoch = true; }
        timeValue.remove("epoch");
    }
    markIfChanged("state.runtime", last, have);
    // Doc is only for change detection; publishing re-projects, no restore needed.
    (void)epoch; (void)hadEpoch;
}

// While a process runs, runtime's continuous fields (elapsed/pulse/water)
// change every loop. Republish at most every 5000ms like process progress;
// discrete edges (start/stop/phase/final) go immediately.
static uint32_t g_lastRuntimeMarkMs = 0;
static bool g_lastRuntimeActive = false;
static const char* g_lastRuntimePhase = "";

// Detect real changes and mark only changed snapshots dirty. Periodic anchors
// (overview every 600s, diagnostics every 3600s) are handled by policy.poll.
void publishStates(uint32_t nowMs) {
    IrrigationApp& app = IrrigationApp::instance();
    const WateringStatus status = app.wateringStatus();

    const bool criticalNow =
        !app.businessReady() || app.unexpectedFlowAlarm() || app.schedulerStorageFault();
    const bool warningNow =
        app.recordStorageFault() || app.eventStorageFault() || app.checkpointStorageFault() ||
        app.schedulerTimeState() == WateringScheduler::TimeState::RtcRollback;
    const char* healthText = criticalNow ? "critical" : warningNow ? "warning" : "normal";
    static bool s_haveHealth = false;
    static const char* s_lastHealth = "";
    const bool healthChanged = !s_haveHealth || s_lastHealth != healthText;

    g_stateDoc.clear();
    projectOverview(app, status);
    markIfChanged("state.overview", g_signatures.overview, g_signatures.haveOverview);

    g_stateDoc.clear();
    projectRuntime(app, status);
    const char* phase = status.active ? activityPhase(status.state) : "idle";
    const bool activeEdge = status.active != g_lastRuntimeActive;
    const bool phaseEdge = status.active && std::strcmp(phase, g_lastRuntimePhase) != 0;
    if (activeEdge || phaseEdge || !status.active ||
        uint32_t(nowMs - g_lastRuntimeMarkMs) >= 5000) {
        markRuntimeIfChanged(g_signatures.runtime, g_signatures.haveRuntime);
        g_lastRuntimeMarkMs = nowMs;
    }
    g_lastRuntimeActive = status.active;
    g_lastRuntimePhase = phase;

    if (const IrrigationConfig* config = app.configuration()) {
        g_stateDoc.clear();
        projectPlans(*config);
        markIfChanged("parameter.plan", g_signatures.plan, g_signatures.havePlan);
    }

    g_stateDoc.clear();
    projectAutomatic(app);
    markIfChanged("parameter.automatic-watering", g_signatures.automatic,
                   g_signatures.haveAutomatic);

    if (g_diagnostics.networkChanged(g_bootId) || healthChanged)
        g_publishPolicy.markDiagnosticsDirty();

