tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationPlatform.cpp
    s_haveHealth = true;
    s_lastHealth = healthText;

    g_publishPolicy.poll(nowMs);

    // Drain due frames with a small burst cap so a single loop never floods the
    // transport. When the outbox/inflight window is full, publishDueSnapshot
    // reports failure and the policy blocks retries briefly; remaining frames
    // go on later loops instead of being dropped.
    for (uint8_t sent = 0; sent < 4; ++sent) {
        if (!publishDueSnapshot(nowMs)) break;
    }
}

}  // namespace

WateringRecordStore* g_wateringStore = nullptr;
IrrigationAuditStore* g_auditStore = nullptr;
iot_device::RecordStream* g_recordStreams[2] = {};
void bindStores(WateringRecordStore& watering, IrrigationAuditStore& audit) {
    g_wateringStore = &watering;
    g_auditStore = &audit;
    g_recordStreams[0] = &watering.recordStream();
    g_recordStreams[1] = &audit.recordStream();
    g_session.setRecordStreams(g_recordStreams, 2);
}

bool configured() { return g_configured; }

bool configure() {
    if (g_configured) return true;
    if (!buildDeviceId()) {
        g_configureResult = "device_id_unavailable";
        ESP32BASE_LOG_E("irrigation", "platform_device_id_unavailable");
        return false;
    }
    if (IRRIGATION_IOT_MQTT_HOST[0] == '\0' ||
        IRRIGATION_IOT_MQTT_CA_PEM[0] == '\0') {
        g_configureResult = "secrets_empty";
        ESP32BASE_LOG_W("irrigation",
                        "platform_mqtt_unconfigured_local_only");
        return false;
    }

    Esp32BaseMqtt::ConnectionConfig mqttConfig;
    mqttConfig.host = IRRIGATION_IOT_MQTT_HOST;
    mqttConfig.port = IRRIGATION_IOT_MQTT_PORT;
    mqttConfig.security = Esp32BaseMqtt::TLS;
    mqttConfig.username = IRRIGATION_IOT_MQTT_USERNAME;
    mqttConfig.password = IRRIGATION_IOT_MQTT_PASSWORD;
    mqttConfig.tls.caCertificatePem = IRRIGATION_IOT_MQTT_CA_PEM;
    mqttConfig.tls.caCertificateLength =
        std::strlen(IRRIGATION_IOT_MQTT_CA_PEM) + 1;

    if (!g_port.configure(mqttConfig)) {
        g_configureResult = "port_configure_rejected";
        ESP32BASE_LOG_E("irrigation", "platform_mqtt_configure_rejected");
        return false;
    }
    g_configureResult = "ok";
    g_configured = true;
    ESP32BASE_LOG_I("irrigation", "platform_configured device=%s", g_deviceId);
    return true;
}

void begin() {
    if (!g_configured) {
        ESP32BASE_LOG_E("irrigation", "platform_configure_failed reason=%s", g_configureResult);
        return;
    }
    buildBootId();
    if (!g_publisher.begin(ESP32BASE_MQTT_MAX_TOPIC_BYTES,
                           ESP32BASE_MQTT_MAX_PAYLOAD_BYTES)) {
        ESP32BASE_LOG_E("irrigation", "platform_publisher_begin_failed");
    }
    if (!g_publishPolicy.begin()) {
        ESP32BASE_LOG_E("irrigation", "platform_publish_policy_begin_failed");
    }
}

void poll() {
    if (!g_configured) return;
    // 诊断窗口的现有采样点：每轮主循环推进一次，不新增定时器。
    // 必须在 read->state->commit 之前，保证三者同轮连续、中间无 observe。
    {
        const bool connected = Esp32BaseWiFi::isConnected();
        g_diagnostics.observe(g_bootId, static_cast<uint32_t>(ESP.getFreeHeap()),
                              connected, connected ? Esp32BaseWiFi::rssi() : 0);
    }
    g_inbox.begin();
    g_port.poll();
    g_inbox.poll(millis());
    progressPoll();

    iot_device::RecordStream::PublishFact publish = nullptr;
    void* publishCtx = nullptr;
    if (g_session.ready() && !g_stopping) {
        publish = &ModelPublisher::publishRecord;
        publishCtx = &g_publisher;
    }
    // Each store owns its SDK RecordStream and its single local durable store.
    if (g_wateringStore) g_wateringStore->poll(publish, publishCtx);
    if (g_auditStore) g_auditStore->poll(publish, publishCtx);

    const uint32_t now = millis();
    if (!g_session.ready() || g_stopping) {
        // Drop the policy when offline so a reconnect re-marks all snapshots dirty.
        if (g_policyConnected) {
            g_publishPolicy.disconnected();
            g_policyConnected = false;
        }
        return;
    }

    if (!g_policyConnected) {
        g_publishPolicy.connected(now);  // marks every state/parameter snapshot dirty
        g_scanCursor = 0;  // first frame of every connection starts at capability 0
        g_policyConnected = true;
    }
    publishStates(now);
}

}  // namespace IrrigationPlatform
